# Rebar Bend Data Hook Length 0 Property

Source: https://www.revitapidocs.com/2026/73f8ee06-a9c1-a869-fcd0-6e1de91eacc9.htm

---

| Rebar Bend Data Hook Length 0 Property |
| --- |

The extension length of the hook at the start.
 The default value is 0\.0\.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HookLength0 { get; set; }
```

```
Public Property HookLength0 As Double
	Get
	Set
```

```
public:
property double HookLength0 {
	double get ();
	void set (double value);
}
```

```
member HookLength0 : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for hookLength0 is not finite |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace